In [1]:
import pandas as pd
import numpy as np

In [4]:
file_path ="../data/raw/Credit card transactions - India - Simple.csv"

df = pd.read_csv(file_path)


df = pd.read_csv(file_path)

In [5]:
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [6]:
df.shape

(26052, 7)

In [7]:
df.columns

Index(['index', 'City', 'Date', 'Card Type', 'Exp Type', 'Gender', 'Amount'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  object
 2   Date       26052 non-null  object
 3   Card Type  26052 non-null  object
 4   Exp Type   26052 non-null  object
 5   Gender     26052 non-null  object
 6   Amount     26052 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

In [9]:
df.describe()

              index         Amount
count  26052.000000   26052.000000
mean   13025.500000  156411.537425
std     7520.708943  103063.254287
min        0.000000    1005.000000
25%     6512.750000   77120.250000
50%    13025.500000  153106.500000
75%    19538.250000  228050.000000
max    26051.000000  998077.000000

In [10]:
df.isnull().sum()

index        0
City         0
Date         0
Card Type    0
Exp Type     0
Gender       0
Amount       0
dtype: int64

In [11]:
df = df.drop(columns=['index'])

In [12]:
df.head()

                    City       Date  Card Type Exp Type Gender  Amount
0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [13]:
df.columns = (
    df.columns
      .str.lower()
      .str.replace(' ', '_')
)

df.columns

Index(['city', 'date', 'card_type', 'exp_type', 'gender', 'amount'], dtype='object')

In [14]:
df['date'] = pd.to_datetime(df['date'])

C:\Users\himan\AppData\Local\Temp\ipykernel_17412\584440916.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['date'] = pd.to_datetime(df['date'])

In [15]:
df.info

<bound method DataFrame.info of                         city       date  card_type exp_type gender  amount
0               Delhi, India 2014-10-29       Gold    Bills      F   82475
1      Greater Mumbai, India 2014-08-22   Platinum    Bills      F   32555
2           Bengaluru, India 2014-08-27     Silver    Bills      F  101738
3      Greater Mumbai, India 2014-04-12  Signature    Bills      F  123424
4           Bengaluru, India 2015-05-05       Gold    Bills      F  171574
...                      ...        ...        ...      ...    ...     ...
26047         Kolkata, India 2014-06-22     Silver   Travel      F  128191
26048            Pune, India 2014-08-03  Signature   Travel      M  246316
26049       Hyderabad, India 2015-01-16     Silver   Travel      M  265019
26050          Kanpur, India 2014-09-14     Silver   Travel      M   88174
26051       Hyderabad, India 2013-10-19  Signature    Bills      M  184410

[26052 rows x 6 columns]>

In [16]:
df = df.sort_values(by='date')

In [17]:
df.duplicated().sum()

0

In [18]:
df = df.drop_duplicates()

In [19]:
df.head()
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 26052 entries, 15464 to 5773
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   city       26052 non-null  object
 1   date       26052 non-null  datetime64[ns]
 2   card_type  26052 non-null  object
 3   exp_type   26052 non-null  object
 4   gender     26052 non-null  object
 5   amount     26052 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 1.4+ MB

                                date         amount
count                          26052   26052.000000
mean   2014-07-30 11:34:44.385075968  156411.537425
min              2013-10-04 00:00:00    1005.000000
25%              2014-03-02 00:00:00   77120.250000
50%              2014-08-02 00:00:00  153106.500000
75%              2014-12-28 00:00:00  228050.000000
max              2015-05-26 00:00:00  998077.000000
std                              NaN  103063.254287